{"class_name": "Tokenizer", "config": {"num_words": 50, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "OOV", "document_count": 148378, "word_counts": "{\"html\": 148378, \"body\": 148378, \"text\": 148380, \"title\": 580, \"span\": 164832, \"h1\": 538, \"table\": 184811, \"tbody\": 184822, \"tr\": 184831, \"td\": 184448, \"b\": 15262, \"font\": 51234, \"a\": 44979, \"div\": 220258, \"center\": 21981, \"p\": 67796, \"h2\": 1370, \"i\": 6152, \"ul\": 18462, \"li\": 19974, \"u\": 802, \"ol\": 2080, \"strong\": 4207, \"dir\": 50, \"em\": 1502, \"form\": 7530, \"h3\": 1362, \"h4\": 687, \"dl\": 958, \"dd\": 2091, \"small\": 2225, \"big\": 234, \"blockquote\": 8462, \"sup\": 1054, \"select\": 4397, \"option\": 4397, \"h5\": 418, \"label\": 200, \"caption\": 19, \"th\": 383, \"nobr\": 1122, \"fieldset\": 105, \"legend\": 5, \"marquee\": 69, \"thead\": 9, \"dt\": 307, \"mainorarchivepage\": 19, \"optgroup\": 163, \"tt\": 263, \"jefferai\": 1, \"o\": 1146, \"smarttagtype\": 1136, \"st1\": 20, \"place\": 13, \"placetype\": 1, \"placename\": 2, \"sub\": 177, \"country\": 2, \"region\": 2, \"h6\": 148, \"http\": 137, \"insert\": 1, \"newselement\": 12, \"cite\": 87, \"code\": 220, \"acronym\": 17, \"l1\": 19, \"blink\": 5, \"l2\": 15, \"l3\": 14, \"l4\": 12, \"l5\": 11, \"l6\": 11, \"l7\": 7, \"l8\": 6, \"l9\": 5, \"l10\": 4, \"l11\": 3, \"l12\": 2, \"left\": 42, \"garden01\": 1, \"pre\": 640, \"artbody\": 152, \"address\": 29, \"agl\": 8, \"container\": 456, \"equiv\": 136, \"mb\": 446, \"if\": 449, \"abbr\": 17, \"intl\": 1, \"links\": 1, \"noindex\": 832, \"whatever\": 1, \"end\": 101, \"id\": 90, \"header\": 1, \"menu\": 5, \"align\": 570, \"l\": 1, \"del\": 1, \"dnt\": 2, \"deadilnk\": 1, \"headline\": 1, \"s\": 1, \"city\": 2, \"state\": 3, \"csobj\": 86, \"epabreadcrumbs\": 6, \"epasidebar\": 13, \"gc3\": 781, \"var\": 38, \"ahref\": 1, \"to\": 2, \"cr\": 28, \"verdana\": 15, \"spacer\": 6, \"page\": 219, \"nav\": 21, \"wsj\": 10, \"content\": 396, \"section\": 198, \"area\": 179, \"footer\": 19, \"defanged\": 523, \"meta\": 523, \"q\": 1, \"companyquotes\": 7, \"mm\": 48, \"beginlock\": 24, \"endlock\": 24, \"textarea\": 5, \"nr\": 2, \"hp\": 2, \"nitf\": 41, \"rdf\": 51, \"rdfs\": 24, \"class\": 12, \"comment\": 1, \"xsl\": 18, \"stylesheet\": 5, \"abc\": 12, \"event\": 7, \"context\": 3, \"date\": 3, \"time\": 3, \"act\": 2, \"agent\": 2, \"role\": 2, \"rights\": 3, \"resource\": 16, \"type\": 4, \"format\": 3, \"length\": 3, \"performance\": 4, \"orchestra\": 2, \"relation\": 2, \"isperformanceof\": 2, \"description\": 14, \"dc\": 12, \"coverage\": 1, \"contributor\": 1, \"mpeg\": 10, \"7\": 10, \"creationmetainformation\": 8, \"creation\": 7, \"creator\": 2, \"name\": 1, \"creationdate\": 3, \"day\": 1, \"month\": 1, \"year\": 1, \"location\": 1, \"classification\": 1, \"genre\": 1, \"mediainformation\": 2, \"mediaprofile\": 2, \"mediaformat\": 2, \"medium\": 1, \"m\": 1, \"id3\": 10, \"ufid\": 1, \"tit2\": 1, \"tpe2\": 1, \"tcon\": 1, \"tmed\": 1, \"tdat\": 1, \"tlen\": 1, \"toal\": 1, \"tcop\": 1, \"template\": 4, \"element\": 4, \"reiser\": 1, \"author\": 1}", "word_docs": "{\"text\": 148378, \"span\": 148378, \"html\": 148378, \"title\": 580, \"body\": 148378, \"h1\": 538, \"tbody\": 94829, \"b\": 15072, \"table\": 94803, \"a\": 44936, \"font\": 39620, \"td\": 94612, \"tr\": 94836, \"p\": 67786, \"center\": 18605, \"div\": 78264, \"h2\": 1370, \"i\": 6102, \"u\": 799, \"li\": 15937, \"ul\": 14800, \"ol\": 1882, \"strong\": 4072, \"dir\": 50, \"em\": 1490, \"form\": 7530, \"h3\": 1362, \"h4\": 687, \"dd\": 945, \"dl\": 951, \"small\": 2195, \"big\": 174, \"blockquote\": 7719, \"sup\": 667, \"option\": 4397, \"select\": 4397, \"h5\": 418, \"label\": 200, \"caption\": 19, \"th\": 383, \"nobr\": 1122, \"legend\": 5, \"fieldset\": 105, \"marquee\": 69, \"thead\": 9, \"dt\": 307, \"mainorarchivepage\": 19, \"optgroup\": 163, \"tt\": 263, \"jefferai\": 1, \"smarttagtype\": 284, \"o\": 294, \"st1\": 12, \"placetype\": 1, \"place\": 13, \"placename\": 2, \"sub\": 177, \"region\": 2, \"country\": 2, \"h6\": 148, \"http\": 137, \"insert\": 1, \"newselement\": 6, \"cite\": 87, \"code\": 220, \"acronym\": 17, \"l1\": 19, \"blink\": 5, \"l2\": 15, \"l3\": 14, \"l4\": 12, \"l5\": 11, \"l6\": 11, \"l7\": 7, \"l8\": 6, \"l9\": 5, \"l10\": 4, \"l11\": 3, \"l12\": 2, \"left\": 39, \"garden01\": 1, \"pre\": 640, \"artbody\": 152, \"address\": 29, \"container\": 227, \"agl\": 8, \"equiv\": 136, \"if\": 226, \"mb\": 223, \"abbr\": 17, \"links\": 1, \"intl\": 1, \"noindex\": 782, \"whatever\": 1, \"end\": 101, \"id\": 90, \"header\": 1, \"menu\": 5, \"align\": 518, \"l\": 1, \"del\": 1, \"dnt\": 2, \"deadilnk\": 1, \"headline\": 1, \"s\": 1, \"city\": 2, \"state\": 3, \"csobj\": 86, \"epabreadcrumbs\": 6, \"epasidebar\": 13, \"gc3\": 249, \"var\": 38, \"ahref\": 1, \"to\": 2, \"cr\": 10, \"verdana\": 15, \"spacer\": 5, \"nav\": 21, \"page\": 219, \"wsj\": 10, \"section\": 198, \"content\": 198, \"area\": 179, \"footer\": 19, \"defanged\": 523, \"meta\": 523, \"q\": 1, \"companyquotes\": 7, \"endlock\": 24, \"mm\": 24, \"beginlock\": 24, \"textarea\": 5, \"nr\": 2, \"hp\": 2, \"nitf\": 41, \"rdfs\": 12, \"class\": 12, \"rdf\": 21, \"comment\": 1, \"xsl\": 5, \"stylesheet\": 5, \"abc\": 12, \"event\": 7, \"context\": 3, \"date\": 3, \"time\": 3, \"act\": 2, \"agent\": 2, \"role\": 2, \"rights\": 3, \"type\": 4, \"resource\": 16, \"format\": 3, \"length\": 3, \"performance\": 4, \"orchestra\": 2, \"relation\": 2, \"isperformanceof\": 2, \"description\": 10, \"dc\": 9, \"coverage\": 1, \"contributor\": 1, \"creation\": 7, \"mpeg\": 10, \"creationmetainformation\": 8, \"7\": 10, \"creator\": 2, \"name\": 1, \"creationdate\": 3, \"day\": 1, \"month\": 1, \"year\": 1, \"location\": 1, \"genre\": 1, \"classification\": 1, \"mediaprofile\": 2, \"mediainformation\": 2, \"medium\": 1, \"mediaformat\": 2, \"m\": 1, \"ufid\": 1, \"id3\": 10, \"tit2\": 1, \"tpe2\": 1, \"tcon\": 1, \"tmed\": 1, \"tdat\": 1, \"tlen\": 1, \"toal\": 1, \"tcop\": 1, \"template\": 4, \"element\": 4, \"reiser\": 1, \"author\": 1}", "index_docs": "{\"8\": 148378, \"7\": 148378, \"9\": 148378, \"40\": 580, \"10\": 148378, \"42\": 538, \"4\": 94829, \"17\": 15072, \"5\": 94803, \"13\": 44936, \"12\": 39620, \"6\": 94612, \"3\": 94836, \"11\": 67786, \"14\": 18605, \"2\": 78264, \"28\": 1370, \"20\": 6102, \"36\": 799, \"15\": 15937, \"16\": 14800, \"26\": 1882, \"23\": 4072, \"72\": 50, \"27\": 1490, \"19\": 7530, \"29\": 1362, \"38\": 687, \"25\": 945, \"34\": 951, \"24\": 2195, \"53\": 174, \"18\": 7719, \"33\": 667, \"22\": 4397, \"21\": 4397, \"48\": 418, \"56\": 200, \"84\": 19, \"50\": 383, \"32\": 1122, \"119\": 5, \"65\": 105, \"70\": 69, \"109\": 9, \"51\": 307, \"85\": 19, \"60\": 163, \"52\": 263, \"158\": 1, \"31\": 284, \"30\": 294, \"83\": 12, \"159\": 1, \"96\": 13, \"139\": 2, \"59\": 177, \"141\": 2, \"140\": 2, \"62\": 148, \"63\": 137, \"160\": 1, \"98\": 6, \"68\": 87, \"54\": 220, \"89\": 17, \"86\": 19, \"120\": 5, \"92\": 15, \"94\": 14, \"99\": 12, \"103\": 11, \"104\": 11, \"112\": 7, \"116\": 6, \"121\": 5, \"125\": 4, \"130\": 3, \"142\": 2, \"74\": 39, \"161\": 1, \"39\": 640, \"61\": 152, \"77\": 29, \"45\": 227, \"110\": 8, \"64\": 136, \"46\": 226, \"47\": 223, \"90\": 17, \"163\": 1, \"162\": 1, \"35\": 782, \"164\": 1, \"66\": 101, \"67\": 90, \"165\": 1, \"122\": 5, \"41\": 518, \"166\": 1, \"167\": 1, \"143\": 2, \"168\": 1, \"169\": 1, \"170\": 1, \"144\": 2, \"131\": 3, \"69\": 86, \"117\": 6, \"97\": 13, \"37\": 249, \"76\": 38, \"171\": 1, \"145\": 2, \"78\": 10, \"93\": 15, \"118\": 5, \"82\": 21, \"55\": 219, \"105\": 10, \"57\": 198, \"49\": 198, \"58\": 179, \"87\": 19, \"43\": 523, \"44\": 523, \"172\": 1, \"113\": 7, \"80\": 24, \"73\": 24, \"79\": 24, \"123\": 5, \"146\": 2, \"147\": 2, \"75\": 41, \"81\": 12, \"100\": 12, \"71\": 21, \"173\": 1, \"88\": 5, \"124\": 5, \"101\": 12, \"114\": 7, \"132\": 3, \"133\": 3, \"134\": 3, \"148\": 2, \"149\": 2, \"150\": 2, \"135\": 3, \"126\": 4, \"91\": 16, \"136\": 3, \"137\": 3, \"127\": 4, \"151\": 2, \"152\": 2, \"153\": 2, \"95\": 10, \"102\": 9, \"174\": 1, \"175\": 1, \"115\": 7, \"106\": 10, \"111\": 8, \"107\": 10, \"154\": 2, \"176\": 1, \"138\": 3, \"177\": 1, \"178\": 1, \"179\": 1, \"180\": 1, \"182\": 1, \"181\": 1, \"156\": 2, \"155\": 2, \"183\": 1, \"157\": 2, \"184\": 1, \"185\": 1, \"108\": 10, \"186\": 1, \"187\": 1, \"188\": 1, \"189\": 1, \"190\": 1, \"191\": 1, \"192\": 1, \"193\": 1, \"128\": 4, \"129\": 4, \"194\": 1, \"195\": 1}", "index_word": "{\"1\": \"OOV\", \"2\": \"div\", \"3\": \"tr\", \"4\": \"tbody\", \"5\": \"table\", \"6\": \"td\", \"7\": \"span\", \"8\": \"text\", \"9\": \"html\", \"10\": \"body\", \"11\": \"p\", \"12\": \"font\", \"13\": \"a\", \"14\": \"center\", \"15\": \"li\", \"16\": \"ul\", \"17\": \"b\", \"18\": \"blockquote\", \"19\": \"form\", \"20\": \"i\", \"21\": \"select\", \"22\": \"option\", \"23\": \"strong\", \"24\": \"small\", \"25\": \"dd\", \"26\": \"ol\", \"27\": \"em\", \"28\": \"h2\", \"29\": \"h3\", \"30\": \"o\", \"31\": \"smarttagtype\", \"32\": \"nobr\", \"33\": \"sup\", \"34\": \"dl\", \"35\": \"noindex\", \"36\": \"u\", \"37\": \"gc3\", \"38\": \"h4\", \"39\": \"pre\", \"40\": \"title\", \"41\": \"align\", \"42\": \"h1\", \"43\": \"defanged\", \"44\": \"meta\", \"45\": \"container\", \"46\": \"if\", \"47\": \"mb\", \"48\": \"h5\", \"49\": \"content\", \"50\": \"th\", \"51\": \"dt\", \"52\": \"tt\", \"53\": \"big\", \"54\": \"code\", \"55\": \"page\", \"56\": \"label\", \"57\": \"section\", \"58\": \"area\", \"59\": \"sub\", \"60\": \"optgroup\", \"61\": \"artbody\", \"62\": \"h6\", \"63\": \"http\", \"64\": \"equiv\", \"65\": \"fieldset\", \"66\": \"end\", \"67\": \"id\", \"68\": \"cite\", \"69\": \"csobj\", \"70\": \"marquee\", \"71\": \"rdf\", \"72\": \"dir\", \"73\": \"mm\", \"74\": \"left\", \"75\": \"nitf\", \"76\": \"var\", \"77\": \"address\", \"78\": \"cr\", \"79\": \"beginlock\", \"80\": \"endlock\", \"81\": \"rdfs\", \"82\": \"nav\", \"83\": \"st1\", \"84\": \"caption\", \"85\": \"mainorarchivepage\", \"86\": \"l1\", \"87\": \"footer\", \"88\": \"xsl\", \"89\": \"acronym\", \"90\": \"abbr\", \"91\": \"resource\", \"92\": \"l2\", \"93\": \"verdana\", \"94\": \"l3\", \"95\": \"description\", \"96\": \"place\", \"97\": \"epasidebar\", \"98\": \"newselement\", \"99\": \"l4\", \"100\": \"class\", \"101\": \"abc\", \"102\": \"dc\", \"103\": \"l5\", \"104\": \"l6\", \"105\": \"wsj\", \"106\": \"mpeg\", \"107\": \"7\", \"108\": \"id3\", \"109\": \"thead\", \"110\": \"agl\", \"111\": \"creationmetainformation\", \"112\": \"l7\", \"113\": \"companyquotes\", \"114\": \"event\", \"115\": \"creation\", \"116\": \"l8\", \"117\": \"epabreadcrumbs\", \"118\": \"spacer\", \"119\": \"legend\", \"120\": \"blink\", \"121\": \"l9\", \"122\": \"menu\", \"123\": \"textarea\", \"124\": \"stylesheet\", \"125\": \"l10\", \"126\": \"type\", \"127\": \"performance\", \"128\": \"template\", \"129\": \"element\", \"130\": \"l11\", \"131\": \"state\", \"132\": \"context\", \"133\": \"date\", \"134\": \"time\", \"135\": \"rights\", \"136\": \"format\", \"137\": \"length\", \"138\": \"creationdate\", \"139\": \"placename\", \"140\": \"country\", \"141\": \"region\", \"142\": \"l12\", \"143\": \"dnt\", \"144\": \"city\", \"145\": \"to\", \"146\": \"nr\", \"147\": \"hp\", \"148\": \"act\", \"149\": \"agent\", \"150\": \"role\", \"151\": \"orchestra\", \"152\": \"relation\", \"153\": \"isperformanceof\", \"154\": \"creator\", \"155\": \"mediainformation\", \"156\": \"mediaprofile\", \"157\": \"mediaformat\", \"158\": \"jefferai\", \"159\": \"placetype\", \"160\": \"insert\", \"161\": \"garden01\", \"162\": \"intl\", \"163\": \"links\", \"164\": \"whatever\", \"165\": \"header\", \"166\": \"l\", \"167\": \"del\", \"168\": \"deadilnk\", \"169\": \"headline\", \"170\": \"s\", \"171\": \"ahref\", \"172\": \"q\", \"173\": \"comment\", \"174\": \"coverage\", \"175\": \"contributor\", \"176\": \"name\", \"177\": \"day\", \"178\": \"month\", \"179\": \"year\", \"180\": \"location\", \"181\": \"classification\", \"182\": \"genre\", \"183\": \"medium\", \"184\": \"m\", \"185\": \"ufid\", \"186\": \"tit2\", \"187\": \"tpe2\", \"188\": \"tcon\", \"189\": \"tmed\", \"190\": \"tdat\", \"191\": \"tlen\", \"192\": \"toal\", \"193\": \"tcop\", \"194\": \"reiser\", \"195\": \"author\"}", "word_index": "{\"OOV\": 1, \"div\": 2, \"tr\": 3, \"tbody\": 4, \"table\": 5, \"td\": 6, \"span\": 7, \"text\": 8, \"html\": 9, \"body\": 10, \"p\": 11, \"font\": 12, \"a\": 13, \"center\": 14, \"li\": 15, \"ul\": 16, \"b\": 17, \"blockquote\": 18, \"form\": 19, \"i\": 20, \"select\": 21, \"option\": 22, \"strong\": 23, \"small\": 24, \"dd\": 25, \"ol\": 26, \"em\": 27, \"h2\": 28, \"h3\": 29, \"o\": 30, \"smarttagtype\": 31, \"nobr\": 32, \"sup\": 33, \"dl\": 34, \"noindex\": 35, \"u\": 36, \"gc3\": 37, \"h4\": 38, \"pre\": 39, \"title\": 40, \"align\": 41, \"h1\": 42, \"defanged\": 43, \"meta\": 44, \"container\": 45, \"if\": 46, \"mb\": 47, \"h5\": 48, \"content\": 49, \"th\": 50, \"dt\": 51, \"tt\": 52, \"big\": 53, \"code\": 54, \"page\": 55, \"label\": 56, \"section\": 57, \"area\": 58, \"sub\": 59, \"optgroup\": 60, \"artbody\": 61, \"h6\": 62, \"http\": 63, \"equiv\": 64, \"fieldset\": 65, \"end\": 66, \"id\": 67, \"cite\": 68, \"csobj\": 69, \"marquee\": 70, \"rdf\": 71, \"dir\": 72, \"mm\": 73, \"left\": 74, \"nitf\": 75, \"var\": 76, \"address\": 77, \"cr\": 78, \"beginlock\": 79, \"endlock\": 80, \"rdfs\": 81, \"nav\": 82, \"st1\": 83, \"caption\": 84, \"mainorarchivepage\": 85, \"l1\": 86, \"footer\": 87, \"xsl\": 88, \"acronym\": 89, \"abbr\": 90, \"resource\": 91, \"l2\": 92, \"verdana\": 93, \"l3\": 94, \"description\": 95, \"place\": 96, \"epasidebar\": 97, \"newselement\": 98, \"l4\": 99, \"class\": 100, \"abc\": 101, \"dc\": 102, \"l5\": 103, \"l6\": 104, \"wsj\": 105, \"mpeg\": 106, \"7\": 107, \"id3\": 108, \"thead\": 109, \"agl\": 110, \"creationmetainformation\": 111, \"l7\": 112, \"companyquotes\": 113, \"event\": 114, \"creation\": 115, \"l8\": 116, \"epabreadcrumbs\": 117, \"spacer\": 118, \"legend\": 119, \"blink\": 120, \"l9\": 121, \"menu\": 122, \"textarea\": 123, \"stylesheet\": 124, \"l10\": 125, \"type\": 126, \"performance\": 127, \"template\": 128, \"element\": 129, \"l11\": 130, \"state\": 131, \"context\": 132, \"date\": 133, \"time\": 134, \"rights\": 135, \"format\": 136, \"length\": 137, \"creationdate\": 138, \"placename\": 139, \"country\": 140, \"region\": 141, \"l12\": 142, \"dnt\": 143, \"city\": 144, \"to\": 145, \"nr\": 146, \"hp\": 147, \"act\": 148, \"agent\": 149, \"role\": 150, \"orchestra\": 151, \"relation\": 152, \"isperformanceof\": 153, \"creator\": 154, \"mediainformation\": 155, \"mediaprofile\": 156, \"mediaformat\": 157, \"jefferai\": 158, \"placetype\": 159, \"insert\": 160, \"garden01\": 161, \"intl\": 162, \"links\": 163, \"whatever\": 164, \"header\": 165, \"l\": 166, \"del\": 167, \"deadilnk\": 168, \"headline\": 169, \"s\": 170, \"ahref\": 171, \"q\": 172, \"comment\": 173, \"coverage\": 174, \"contributor\": 175, \"name\": 176, \"day\": 177, \"month\": 178, \"year\": 179, \"location\": 180, \"classification\": 181, \"genre\": 182, \"medium\": 183, \"m\": 184, \"ufid\": 185, \"tit2\": 186, \"tpe2\": 187, \"tcon\": 188, \"tmed\": 189, \"tdat\": 190, \"tlen\": 191, \"toal\": 192, \"tcop\": 193, \"reiser\": 194, \"author\": 195}"}}